{
    "author": "David Quintanilla",
    "eng" :{
        "details":"<p>Frontend developer.</p><p>Student and System Engineering Student in Universidad Centroamericana.</p><p><b>#SOSNicaragua. 🇳🇮</b></p>",
        "aboutme": "<p>Hello! I'm David Quintanilla Ruiz, a programmer who also dabbles in the world of design. I consider myself a fast learner and possess notable communication and leadership skills. Currently, I have expertise in creating and designing websites. I am someone who easily adapts to the needs of the moment and I have also experimented with mobile applications.</p><p>My most important project has been 'Expediente Docente,' a platform that is still being developed for the 'Universidad Centroamericana' in my country, Nicaragua.<br><br>Currently, I am a student of Systems Engineering at the 'Universidad Centroamericana' of Nicaragua, and I expect to complete my studies in 2026.</p><p>Among my interests are playing video games, watching technology videos, and occasionally drawing.</p>"
    },
    "es": {
        "details":"Programandor y diseñador web. Estudiante de Ingeniería en Sistemas en Universidad Centroamericana. #SOSNicaragua",
        "aboutme": "¡Hola! Soy David Quintanilla Ruiz, soy programador y también incursiono en el mundo del diseño, considero que aprendo de manera muy rápida, también tengo habilidades destacables de comunicación y liderazgo. Actualmente tengo dominio en la creación y diseño de páginas web. Soy una persona que se adapta fácilmente a las necesidades del momento, también he experimentado con aplicaciones para móviles.<br>Mi proyecto de más importancia ha sido ‘Expediente Docente’, una plataforma que aún se sigue desarrollando para la Universidad Centroamericana de mi país, Nicaragua.<br>Actualmente, soy estudiante de Ingeniería en Sistemas en la Universidad Centroamericana de Nicaragua, espero acabar con mis estudios en 2026.<br>Entre mis gustos está jugar videojuegos, ver videos de tecnología y dibujar... a veces."
    }
    
}