[
    {
        "icon": "/blog/expedoc.png",
        "title": "Expediente Docente - Generalities",
        "date": "2004-04-19",
        "tags": "Fullstack Lead",
        "author":"0",
        "details": "<h3>Generalities</h3><p>To begin with, it is important to clarify the objectives and target audience of this project. The project 'Expediente Docente' was specifically developed for the Education Department at Universidad Centroamericana de Nicaragua as part of the mid-practice program within the System Engineering career.</p><p'Expediente Docente' serves as an internal social network within the Education Department, but with a distinct purpose. Its primary objective is to effectively manage the academic and professional lives of the department's teachers, while also providing valuable feedback to enhance their teaching practices.</p><h3>Project Vision</h3><p>Although it was necessary to meet the stakeholder's objectives in terms of required functionalities, I had a different vision personally. I considered the interfaces and user experience of the university's web services to be outdated, unfriendly, and simplistic.</p><p>One of the limitations I identified was the use of Bootstrap in the project and requirements, as it greatly restricted the visual freedoms of the application. By consensus with my development team, we decided not to use this graphical framework and create the styles from zero. The visual result was considerably better than if we had used Bootstrap.</p><p>The objective I set for the application was to surpass any existing platform within the university and in my country. This is not an unrealistic goal to imagine since the majority of universities do not have a similar system, and if they do, they rely on an external CMS or LMS.</p><p>I believe that the development results were satisfactory for both the stakeholder and the development team. We managed to achieve the set objectives and, at the same time, significantly improved the visual and user experience compared to other existing platforms.</p><h3>In the application</h3><p>Within the 'Expediente Docente' application, there are various main menus available: Dashboard, Feedback, Academic Areas, Convocations, Teachers, Users, Departments, Expedient, Role, and Role Options. Each main menu has specific permission requirements, although a role with all options enabled has unrestricted access to all features. The system offers a range of functionalities, which are outlined below:</p><h4>Dashboard</h4><p>The system is equipped with two points of view of Dashboard, one special for users consider Administrator and other ordinary for who consider teacher or ordinary users.</p><h4>Department</h4><p>This is the major container of the system, the department is who globes the distinct areas of the college, the department can have multiples academic areas.</p><h4>Academic Areas</h4><p>This is the container of the users.</p><h4>Users</h4><p>Basically, the user access to the platform.</p><h4>Teachers</h4><h4>Expedient</h4><p>The expedient is all the relevant info of the teacher, with all this mini-expedient</p><table><tr><th>Name</th><th>Description</th></tr><tr><td>General data</td><td>Relevant personal data of users like birthday, ID, mail, gender and others.</td></tr><tr><td>Professional summary</td><td>Is a summary of 200 characters with the job experience.</td></tr><tr><td>Degree</td><td>Are the college degree of the teacher.</td></tr><tr><td>Courses</td><td>Are the courses taught in their exercise of teacher in the college or other institutions.</td></tr><tr><td>Intellectual production</td><td>Basically, are the books or articles published in APA format.</td></tr><tr><td>Projects</td><td>Projects where the teacher has a participation with any role.</td></tr><tr><td>Recognitions</td><td>Are recognitions granted for any institution, for participations or other reasons.</td></tr><tr><td>Teacher training</td><td>These are courses that the teacher has taken for their education.</td></tr><tr><td>Professional Experience</td><td>Is the profesional experience.</td></tr><tr><td>Professional Expertise</td><td>Essentially areas of expertise of the teacher.</td></tr></table><h3>Convocations</h3><p>These are events that open up to system users to fill out their data or receive feedback from users with special roles, who in practice are their superiors.</p><h3>Role</h3><p>Roles are badges or positions held by a user; they do not do anything on their own.</p><h3>Role Options</h3><p>These are the permissions granted to a role.</p><h3>Feedback</h3><p>Feedback serves to provide a message of constructive criticism in the exercise of the teaching role.</p><h3>Comments</h3><p>Comments are available as responses in the Feedback section and in each section of the Record.</p><h3>Search Functions</h3><p>These are ways to filter data or information in any of the sections. They have cumulative filters to increase accuracy and also have a simple search function.</p><h3>Settings</h3><p>Settings include accessibility configurations, such as dark mode, dyslexia-friendly font, font size, high contrast, square borders, and user credentials, which allow changing user credentials.</p><h3>Record Evaluation</h3><p>This is a special functionality for users with special roles, which allows leaving a comment and approving or revoking the data provided by the evaluated teacher. This applies to each section of the record.</p><h3>Toggle Role</h3><p>This feature is used if a user has more than one role. It provides a quick way to switch the system's perspective.</p><h3>Application development status</h3><p>As of the date of this post, the application is still in the development phase. However, our stakeholders are pleased with the progress made so far in developing the web application. There are a few remaining functionalities to be implemented and minor details to be addressed, which we anticipate completing within the next two months. This will bring us closer to the final stages of development and the subsequent deployment of the system on the servers of Universidad Centroamericana.</p>",
        "url": "expedoc-development"
    }
]